# Student Alcohol Consumption

### Introduction:

This time you will download a dataset from the UCI.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from student-mat.csv

### Step 3. Assign it to a variable called df.

In [2]:
df = pd.read_csv('data/student-mat.csv')

### Step 4. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [3]:
df_reduced = df.loc[:,'school':'guardian']

### Step 5. Create a lambda function that captalize strings.

In [4]:
def capitalize(p_in): return p_in.upper()

### Step 6. Capitalize both Mjob and Fjob

In [5]:
df_reduced['Mjob'] = df_reduced['Mjob'].apply(lambda x: capitalize(x))
df_reduced['Fjob'] = df_reduced['Fjob'].apply(lambda x: capitalize(x))

### Step 7. Print the last elements of the data set.

In [6]:
df_reduced.tail()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
390,MS,M,20,U,LE3,A,2,2,SERVICES,SERVICES,course,other
391,MS,M,17,U,LE3,T,3,1,SERVICES,SERVICES,course,mother
392,MS,M,21,R,GT3,T,1,1,OTHER,OTHER,course,other
393,MS,M,18,R,LE3,T,3,2,SERVICES,OTHER,course,mother
394,MS,M,19,U,LE3,T,1,1,OTHER,AT_HOME,course,father

### Step 8. Did you notice the original dataframe is still lowercase? Why is that? Fix it and captalize Mjob and Fjob.

In [7]:
df['Mjob'] = df['Mjob'].apply(lambda x: capitalize(x))
df['Fjob'] = df['Fjob'].apply(lambda x: capitalize(x))

### Step 9. Create a function called majority that return a boolean value to a new column called legal_drinker

In [8]:
def majority(age): return age >=18

In [9]:
df_reduced['legal_drinker'] = df_reduced['age'].apply(lambda x: majority(x))

In [17]:
df_reduced.head()[['age','legal_drinker']]

   age  legal_drinker
0   18           True
1   17          False
2   15          False
3   15          False
4   16          False

### Step 10. Multiply every number of the dataset by 10. 
##### I know this makes no sense, don't forget it is just an exercise

In [18]:
def multiply(p_in): return p_in*10

In [19]:
#df.select_dtypes(include=[np.number])

df_reduced.age  = df_reduced.age.apply(lambda x: multiply(x))
df_reduced.Medu = df_reduced.Medu.apply(lambda x: multiply(x))
df_reduced.Fedu = df_reduced.Fedu.apply(lambda x: multiply(x))

In [23]:
df_reduced.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,180,U,GT3,A,40,40,AT_HOME,TEACHER,course,mother,True
1,GP,F,170,U,GT3,T,10,10,AT_HOME,OTHER,course,father,False
2,GP,F,150,U,LE3,T,10,10,AT_HOME,OTHER,other,mother,False
3,GP,F,150,U,GT3,T,40,20,HEALTH,SERVICES,home,mother,False
4,GP,F,160,U,GT3,T,30,30,OTHER,OTHER,home,father,False